import React from 'react'
import Typography from '@material-ui/core/Typography';
import Link from '@material-ui/core/Link'

export const step1 = [
    <div>
        <p><b>Бизнес-аналитик</b> — специалист по улучшению процессов бизнеса. Технические знания для этой роли не самое главное, куда важнее знания процессов или способность быстро их понять. Нужно уметь слушать, задавать правильные вопросы и вычленять проблемы пользователей.</p>
        <p><b>Задачи</b> — анализ и оптимизация бизнес процессов. Такой аналитик хорошо знает процессы своей компании (или направления, с которым работает). Понимает лучшии практики, конкурентов и узкие места бизнеса. Применяет свои знания, чтобы улучшать процессы.</p>
        <p><b>Скилы</b> — знания предметной области; управление требованиями; составление диаграмм бизнес процесса; коммуникативные навыки; качественные исследования и т.д.</p>
        <p><b>Данные</b> — бизнес процессы.
        </p>
    </div>
];

export const step2 = [
    <div>
         <Typography variant="h4">Игра. Пазл</Typography>
         <p>
         Требования от бизнеса было написано на листе бумаге. Пока оно дошло до вас лист помялся, запачкался и порвался на кусочки. Нужно восстановить целостность листа
         </p>
    </div>
];

export const step3 = [
    <div>
    <p><b>Системный аналитик</b> — переводчик пожеланий бизнеса в техническую плоскость. Понимает технические ограничения, нюансы работы системы и сложности, возникающие у программистов. Вместе с тем, может говорить с бизнесом, понимать их требования и сразу видеть противоречия.</p>
    <p><b>Задачи</b> — перевод требований от бизнеса на технический язык. Хорошо знает, как устроена разрабатываемая система и софт вообще. Может читать код.</p>
    <p><b>Скилы</b> — технические знания; архитектура софта; техническая документация; проектирование систем и взаимодействие и т.д.</p>
    <p><b>Данные</b> — устройство разрабатываемой системы.</p>
    <Typography variant='body2'>
    Зачастую задачи бизнес и системного аналитика пересекаются. Часто один сотрудник совмещает обе роли. И в нюансах бизнеса компании понимает и одновременно делает тех описание для команды разработки. Подобное совмещение практикуется повсеместно, имейте ввиду.
    </Typography>
</div>
];
export const step4 = [
    <div>
    <Typography variant="h4">Игра. Перевод хотелок бизнеса. </Typography>
    <p>
        В тексте нужно заменить некоторые фразы написанных обычным языком на профессиональные термины. Например “попровь внутри той хрени сверху страницы” - внести изменения в футере 
    </p>
</div>
];

export const step5 = [
    <div>
    <Typography variant="h4">Дополнительные но редко используемые подвиды аналитиков.</Typography>
    <p><b>Продуктовый аналитик</b> — исследует как улучшать продукт, помогать продукт менеджеру и команде понять что происходит и как продукт может расти.</p>
    <p><b>UX-аналитик</b> — выяснит какие действия вызывают у аудитории сложности или не очевидны для нее. Поможет понять, как упростить взаимодействие пользователя и системы.</p>
    <p><b>Web-аналитик</b> — скажет наверняка, что происходит с сайтом. Отслеживает действия посетителей, использование кнопок, достижение целей. Понимает узкие места взаимодействия. Делает выводы об успехе новых страниц и обновления существующих.</p>
    <p><b>Дата-аналитик</b> — специалист по количественным исследованиям. Скрупулезно проверяет изменения в трендах, сообщает, когда что-то идет не так и исследует большие массивы данных. Вероятно, хочет, и наверняка станет, дата-сайентистом.</p>
    </div>
]
export const finalStep = [    
<div>
    Результатом работы аналитиков является Техническое Задание, оно же ТЗ. Можно идти дальше
</div>
];