
import React from 'react';
import Typography from '@material-ui/core/Typography';
import Link from '@material-ui/core/Link'

export const step1 = [
    <div>
        <Typography variant="h4">UX/UI-дизайн</Typography>
        <p>
            <b>User Experience и User Interface</b> - это дизайн пользовательского опыта и пользовательских интерфейсов. Эти понятия часто приравнивают друг к другу, однако между ними есть существенная разница.
      UX-дизайнер создает систему и структурирует информацию, а дизайнер интерфейса оформляет эту систему, придавая ей форму и цвет. Если обобщить, UX-дизайнер отвечает за то, как продукт работает, а UI-дизайнер - за внешний вид продукта.
      Web-дизайн
      </p>
        <Typography variant="h4">Web-дизайн</Typography>
        <p>
            Эта отрасль web-разработки и разновидность дизайна охватывает проектирование и художественное оформление сайтов и веб-приложений, их макетов и прототипов. То, как выглядит та или иная страница в сети, или любое приложение, - результат трудов web-дизайнера.
            На сегодняшний день работа такого дизайнера включает в себя следующие этапы: общение с клиентом, проектирование сайта, графический дизайн и визуализацию прототипа. Грамотный web-дизайнер также разбирается в принципах верстки, SEO (Search Engine Optimization, или Поисковая Оптимизация) и SMM (Social Media Marketing, или Маркетинг в социальных сетях).
        </p>
        <Typography variant="h4">Графический дизайн</Typography>
        <p>
            Это сегодня пожалуй, самое распространенное направление дизайна, окружающее нас повсюду: плакаты, упаковки товаров, этикетки, обложки журналов и книг, телевизионные заставки - всё это создают графические дизайнеры. Причем масштаб такого дизайн-проекта может варьироваться от визитки до навигационного дизайна на государственном уровне.
            В большинстве случаев именно удачный графический дизайн заставляет клиента приобрести ту или иную вещь.
        </p>
        <Typography variant="h4">Гейм-дизайн</Typography>
        <p>
            В ведении гейм-дизайнера создание формы и содержания компьютерных игр, включая придумывание правил игры, ее уровней, персонажей, миссий, а также оформления.
      </p>
        <Typography variant="h4">Промышленный дизайн</Typography>
        <p>
            Это дизайн абсолютно любых изделий - от кружек до авиационной техники. Спроектировать объекты таким образом, чтобы они были максимально удобными в использовании, выглядели как можно более выигрышно, а расходы на изготовление максимально сократились - задача такого дизайнера.
      </p>
        <Typography variant="h4">Дизайн интерьера</Typography>
        <p>
            Это, как нетрудно догадаться, оформление помещений. Дизайнер должен продумать всё таким образом, чтобы человеку было максимально комфортно находиться в интерьере и он получал эстетическое удовольствие от обстановки.
      </p>
    </div>
]

export const step2=[
    <div>
         <Typography variant="h4">Игра. Глазомер</Typography>
         <p>
            У дизайнеров со временем вырабатывается необыкновенная способность на глаз определять точное количество пикселей. Пользователю предлагается проверить свои силы в рисовании прямоугольника определенного размера. Даем 5 попыток, на рисование, далее замеряем разницу, от исходных данных. 
            <br/>
            Пример
            <ul>
                <li> <Link href='https://www.pixact.ly/'>https://www.pixact.ly/</Link> </li>
            </ul>
         </p>
    </div>
]

export const step3=[
    <div>
        <Typography variant="h4">Стадии разработки дизайна сайта.</Typography>
        <p>Создание дизайна сайта — один из самых трудоемких процессов при его разработке. Кто бы что ни говорил, дизайн играет одну из ведущих ролей. Когда мы заходим на сайт, первое, что мы видим, — это картинку, то есть дизайн. Срабатывает визуальное восприятие, и от того, каким оно будет, зависит и наше пользовательское отношение. Причем так происходит везде.</p>

        <Typography variant="h5">1. Анализ целевой аудитории (ЦА)</Typography>
        <p>Как это делается? Придумываем пару-тройку персонажей (будем так их называть) и объективно оцениваем их возраст, место проживания, характер, предпочтения, образ жизни и даже то, как они выглядят.</p>

        <Typography variant="h5">2. Общий стиль и композиция</Typography>
        <p>Если смотреть на дизайн сайта в совокупности, первое правило, которому он должен соответствовать — это целостность. Все блоки на сайте должны являться частью единого целого. Нужно располагать элементы на сайте так, чтобы они принадлежали к одному выбранному стилю. Нельзя создавать несочетаемые между собой компоненты.</p>
        <p>Следующее правило грамотной композиции — подчиненность. Любой элемент на сайте должен быть обоснован. Почему мы выбрали данный цвет? Зачем мы сделали шрифт такого размера? Для чего мы добавили вон ту маленькую черточку? И так далее. На все эти вопросы вы должны дать точный и ясный ответ.</p>
        <p>Ни одна композиция не будет выполнять своих функций без расстановки акцентов и контраста.</p>
        <p>Акцентами в веб-дизайне, в большинстве случаев, выступают кнопки, заголовки и какие-либо изображения. Самое важное — не перепутать все компоненты и правильно их ранжировать.</p>
        <p>Под акцентными изображениями мы подразумеваем те изображения, которые привлекут внимание пользователей и вызовут правильные эмоции. В большинстве случаев это картинка на главной странице сайта либо баннер.</p>
        
        <Typography variant="h5">3. Цвет</Typography>
        <p>Переходим, пожалуй, к самому основному в веб-дизайне — к цвету. Весь этот мир человек воспринимает в цвете с самого рождения. Куда бы мы ни посмотрели, везде мы видим цветную картинку. Поэтому визуальное восприятие — самое первое, что вызывает определенные ассоциации у пользователей. </p>
        <p>У каждого человека ассоциации с цветом разные. Каждый воспринимает все по-своему. Существуют группы цветов, которые воздействуют на пользователя одинаково практически всегда.</p>
        <ul>
            <li>Красный — смелость, опасность.</li>
            <li>Зеленый — цвет жизни, умиротворенности.</li>
            <li>Синий — свежесть, легкость.</li>
            <li>Желтый — энергия, радость.</li>
            <li>Белый — доброта, чистота.</li>
            <li>Черный — стабильность, уверенность.</li>
        </ul>
        <p>Для многих компаний главными цветами являются цвета логотипа. Сначала разрабатывается брендинг, затем уже сайт. Если у компании существует свой фирменный стиль, цвета для сайта используем соответствующие.</p>
        <p>Смотрим на палитру, которая нам доступна, и подбираем для начала акцентный цвет. В первую очередь он используется для кнопок.</p>
        <p>Фоновый цвет очень важен при информативном сайте. Он не должен отвлекать пользователя от чтения. Подбираем такой оттенок, который будет снимать нагрузку с глаз и не раздражать своим присутствием.</p>
        <p>Вспомогательный тон — один из оттенков главного фона. Помогает визуально разметить другие блоки на странице. Вспомогательный цвет показывает отличие второстепенных действий от основных. Его главная задача отделить основной цвет от других.</p>

        <Typography variant="h5">4. Типографика</Typography>
        <p>Правильно подобранные шрифты повышают удобство пользования сайтом. Он должен быть не слишком большим и не слишком маленьким, то есть должен легко восприниматься, не раздражать и хорошо читаться</p>
        <p>У каждого шрифта есть свое семейство (Font Family) или гарнитура. Гарнитура — совокупность шрифтов, которые объединены определенным стилем и имеют различное начертание.</p>
        <p>Шрифты имеют кегль — величину в пунктах, трекинг — равномерное расстояние между буквами, кернинг — избирательное расстояние между буквами.</p>
        <p>Когда на странице появляется блок с текстом, для него задается интерлиньяж — расстояние между строками текста. Иногда им пренебрегают, из-за чего создается ощущение сжатости текста, который сложно прочитать.</p>
    </div>
]

export const step4=[
    <div>
        <Typography variant="h4">Игра. Угадай цвет </Typography>
        <p>Нужно найти разницу в оттенке цвета</p>
        <p>Примеры</p>
        <ul>
            <li> <Link href='http://kolor.moro.es/'>http://kolor.moro.es/</Link> </li>
            <li> <Link href='https://www.xrite.com/hue-test'>https://www.xrite.com/hue-test</Link> </li>
            <li> <Link href='https://meduza.io/games/tsvet-nastroeniya-krasnyy-igra-meduzy'>meduza</Link> </li>
        </ul>
        
    </div>
]

export const finalStep = [
    <div>
        <Typography>
            Создание дизайна — всегда очень сложная и ответственная задача. Даже если очень хорошо знать всю вышеизложенную информацию, не всегда удастся попасть в цель. Все люди разные, и всем не угодишь =). Дизайн — абсолютно субъективная вещь. Если бы все было так просто, мы бы уже давно забыли о дизайне и пользовались бы общедоступным сводом законов и правил.
    </Typography>
    </div>
]