import React from 'react'
import Typography from '@material-ui/core/Typography';
import Link from '@material-ui/core/Link'

export const step1 = [
    <div>
        <p>
        Существует старый анекдот про парашютиста, которого снесло ветром на дерево, и он повис в нескольких метрах над землей. Спустя некоторое время появляется случайный прохожий, у которого незадачливый парашютист спрашивает, где он находится.
        <br/>
        Прохожий: «Вы в шести метрах над землей».<br/>
        Парашютист: «Вы, должно быть, программист?» <br/>
        Прохожий: «Да, но как вы догадались?» <br/>
        Парашютист: «Вы дали точный, но совершенно бессмысленный ответ».
        </p>
        <p>
        Чтобы ответить на вопрос кто такой программист, давайте обратимся в википедию, там мы найдем короткий исчерпывающий ответ “Программи́ст — специалист, занимающийся программированием, то есть созданием компьютерных программ.” Похож, что это определение тоже писал программист, давайте попробуем разобраться для чего вообще нужны программы:
        </p>
        <ul>
            <li>сидеть в интернете - веб разработка</li>
            <li>зависать в телефоне - мобильная разработка</li>
            <li>поиграть - геймдев</li>
            <li>посчитать зарплату - 1с</li>
            <li>все остальное - “тыжпрограммист”</li>
        </ul>
        <p>
        Для программиста важно:
        </p>
        <ul>
            <li>Уметь работать с системой контроля версий</li>
            <li>Иметь базовые знания алгоритмов и структур данных</li>
            <li>Иметь аналитический склад ума</li>
            <li>Обладать навыками командной работы</li>
            <li>Внимание к деталям</li>
            <li>Любознательность</li>
            <li>Постоянное обучение</li>
            <li>Знание английского языка</li>
        </ul>   


    </div>

];
export const step2 = [
    <div>
        <Typography variant="h4">Frontend</Typography>
        <p>Эти программисты специализируются на интерфейсах и веб приложений. Все кнопочки на экране, которые вы можете нажимать, выпадающие меню, и весь внешний вид сайта или приложения – их сфера деятельности. Т.е. Front-end – это работа над динамикой интерактивных интерфейсов. Также важно понимать, что такое адаптивная и мобильная верстка, изучить работу популярных CMS, разбираться в серверных технологиях и принципах бэкэнда, изучить основы SEO-оптимизации, работу с веб-шрифтами</p>
        <p>Базовые знания технологий:</p>
        <ul>
            <li>HTML и CSS;</li>
            <li>Различные фреймворки;</li>
            <li>препроцессоры (SASS/LESS);</li>
            <li>JavaScript вместе с библиотеками;</li>
            <li>Системы отладки и сборки программ.</li>
        </ul>
    </div>
    ];
export const step3 = [
<div>
         <Typography variant="h4">Backend</Typography>
         <p>Бэкенд программисты занимаются разработкой и поддержкой серверной части веб-приложений. Они создают программы, которые выполняются на серверах и осуществляют вычисления, необходимые для работы сайтов и интернет-серверов. Также backend программисты отвечают за создание баз данных, обработку и хранение информации в них.</p>
         <p>Backend-разработчик – это интересная и перспективная профессия для тех, кому нравится логика, математика, разработка алгоритмов.</p>
         <p>Что нужно:</p>
         <ul>
            <li>Знание хотя бы одного «серверного» языка программирования: PHP, Go, ASP.NET, C/C++, Python, Ruby, Java. В некоторых случаях достаточно знания JavaScript для бэкенда (Node.js), но это скорее как плюс, чем как пункт.</li>
            <li>Знание API (REST, SOAP — всё реже).</li>
            <li>Понимание принципов работы серверов Apache, NGINX, IIS и проч.</li>
            <li>Навыки написания юнит-тестов и покрытия кода тестами.</li>
            <li>Основы сетевой безопасности и знание инструментов её обеспечения.</li>
            <li>Знание популярных веб-фрейморков, которые способны решать задачи разработки конкретного приложения.</li>
            <li>Навыки написания запросов к БД и проектирования баз данных.</li>
        </ul>
    </div>
];
export const step4 = [
<div>
    <Typography variant="h4">Игра. FlexBox Froggy</Typography>
    <p>Проходим по основам html и css</p>
    <ul>
        <li><Link target="_blank" href="Пример https://flexboxfroggy.com/#ru">Пример https://flexboxfroggy.com/#ru</Link></li>
        <li><Link target="_blank" href="http://cssgridgarden.com/#ru">Пример 2</Link></li>
        <li><Link target="_blank" href="https://github.com/thomaspark/gridgarden/">Пример 3</Link></li>
    </ul>
   
    
    
</div>
];
export const step5 = [
<div>
    <Typography variant="h4">Мобильная разработка (IOS и Android)</Typography>
    <p>На первый взгляд кажется, что всё просто: мобильный разработчик — это тот, кто разрабатывает программы для мобильных устройств. Всё верно. Но большинство людей не из мира ИТ под мобильными устройствами подразумевают смартфоны и особо продвинутые — планшеты. Но мы-то с вами знаем, что мобильные устройства — это не только наши любимые гаджеты, носимая электроника, но и различные научные аппараты, компоненты исследовательских систем на базе гаджетов, компоненты интернета вещей. Это огромный мир приспособлений, который будет становиться всё больше и больше — мобильные приложения востребованы обычными пользователями, бизнесом, медициной, наукой и т.д. Поэтому профессия мобильного разработчика — это однозначно профессия будущего, во всяком случае ближайших 10-15 лет это точно. </p>
    <p>Технологический стек:</p>
    <ul>
        <li>Android: знание Android SDK, Java, Kotlin, Scala (в меньшей степени), Rest/SOAP, различные API, SQLite и т.д.</li>
        <li>iOS: Objective-C, С#, Swift, знание Apple Development Guidelines, XCode</li>
    </ul>
</div>
];
export const step6 = [
<div>
    <Typography variant="h4">Game Developer</Typography>
    <p>Разработчик игровых приложений – это одно из крупных понятий. Обычно Game разработчики делятся на специализации: разработка декстопных, мобильных игр и MMORG.</p>
    <p>Специалисты этого направления востребованы в игровых студиях и стартапах. Занимаются разработкой игр с нуля, а также поддержкой, исправлением багов и другими обновлениями.</p>
    <p>Необходимые технологии:</p>
    <ul>
        <li>C/С++. С# или другой язык программирования того же класса;</li>
        <li>Java и библиотеки;</li>
        <li>Open GL или DirectX;</li>
        <li>Unity, Unreal Engine, Torque или другие игровые движки.</li>
    </ul>
</div>
];
export const step7 = [
<div>
    <Typography variant="h4">1C программист</Typography>
    <p>Специалисты по работе с различными конфигурациями программного обеспечения 1С. В профессиональной среде к этой категории отношение двоякое. Многие разработчики язык 1С вообще не считают языком программирования, а специалистов по 1С – программистами. Но, тем не менее, именно так называют эту специальность. И в России она широко востребована.</p>
    <p>Программисты 1С занимаются созданием отраслевых конфигураций на основе базовых (типовых), доработкой и настройкой существующих программных решений под особенности бизнеса клиента, написанием внешних обработок и отчетов.</p>
    <p>Вакансию программиста 1С можно увидеть от имени компании-партнера 1С, которая занимается внедрением этого программного продукта в регионе. Также программиста 1С нанимают в штат средние и крупные предприятия, которые нуждаются в постоянном обслуживании.</p>
    <p>Что должен знать 1С-программист:</p>
    <ul>
        <li>Язык конфигураций 1С;</li>
        <li>Типовые конфигурации (Бухгалтерия, Предприятие, Управление торговлей и т.д.);</li>
        <li>Базы данных T-SQL.</li>
    </ul>
</div>
];
export const step8 = [
<div>
    <Typography variant="h4">Игра. Найди баги</Typography>
    <p>Любой программист, должен быть внимательным, одна ошибка и код не будет работать. Игрой это можно назвать весьма условно. Вам предлагается кусочек кода, нужно найти в нём ошибку и исправить. Большая круглая кнопка посередине вверху запускает проверку.</p>
</div>
];


export const finalStep = [
    <div>
        <p>
            Мои поздравления, Вы отличный программист (но это не точно).
        </p>
        <p>
            Накодили, теперь время тестировать. 
        </p>
    </div>
];