import React from 'react'
import Typography from '@material-ui/core/Typography';
import Link from '@material-ui/core/Link'

export const step1 = [
    <div>
        <p>
            Менеджер проекта (руководитель проекта или Project manager) — это специалист, отвечающий за успешное выполнение проекта:
        </p>
        <ul>
            <li>в указанные заказчиком сроки;</li>
            <li>с необходимым качеством;</li>
            <li>при фиксированном бюджете и ограниченных человеческих ресурсах;</li>
            <li>при необходимых требованиях со стороны заказчика.</li>
        </ul>
    </div>
]; 
export const step2 = [
    <div>
        <Typography variant='h4'>Требования к менеджеру проектов</Typography>
        <p>
        Требования к менеджерам проектов зависят от сферы деятельности компании. На стройке одно нужно, в ИТ — другое, в банковской сфере — третье. Средний набор требований таков:
        </p>
        <ul>
            <li>Высшее образование (желательно по профилю работы компании);</li>
            <li>Опыт работы от 1 года (серьезные должности требуют более 3-х лет);</li>
            <li>Хорошее знание сферы деятельности и ее рынка;</li>
            <li>Умение составлять документацию (техническую и проектную);</li>
            <li>Опыт руководства (в рамках проектных команд);</li>
            <li>Отличные коммуникативные навыки.</li>
        </ul>
        <p>
            Чем занимается менеджер проекта
            Основная обязанность PM — довести идею до реализации в срок, используя все ресурсы. Звучит довольно мирно, но за каждым словом скрывается целый ряд непростых задач.
        </p>
    </div>
];
export const step3 = [
    <div>
         <Typography variant="h4">Игра. Сортировка</Typography>
         <p>Нужно для бизнес требований правильно назначить исполнителя (фронт, бэк, дизайн, девопс и т.д.)</p>
    </div>
];
export const step4 = [
    <div>
        <Typography variant='h4'>Стратегические задачи</Typography>
        <p>Например, возьмём создание сайта. В стратегическом плане PM должен учесть интересы сразу трех сторон:</p>
        <ol>
            <li>Заказчика. Его должен устроить сайт, но если клиент останется недоволен — виноват менеджер проекта.</li>
            <li>Компании. Проект должен принести прибыль. Экономия бюджета приветствуется и поощряется. Если проект оказался убыточным (самая частая причина этого — не уложились в сроки), виноват менеджер проекта.</li>
            <li>Команды. Если у исполнителей низкая мотивация, внутри команды возникают конфликты, а проект не способствует профессиональному росту — виноват менеджер проекта.</li>
        </ol>
        <Typography variant='h4'>Практические задачи</Typography>
        <p>
        Менеджер проектов составляет план разработки сайта, организует команду и выстраивает весь процесс так, чтобы он соблюдался и был выполнен в срок. Исходя из методологии агентства, планы могут корректироваться или же, наоборот, опираться на изначальный замысел.
        </p>
        <ol>
            <li>Понимать реальные потребности клиента и предлагать ему тот функционал, который необходим. Он способен объяснить, например, почему дополнительные функции не являются обязательными на данном этапе разработки.</li>
            <li>Обрабатывать задачи и делить их на небольшие подзадачи, которые он делегирует исполнителям и добивается соблюдения дедлайнов.</li>
            <li>Видеть проект целиком. В каждый момент времени он знает, на каком этапе находится работа, и понимает, что составленный план — не просто бумажка для отчета, а настоящая дорожная карта, по которой движется вся команда.</li>
            <li>Управлять рисками. Для PM нет понятия «внезапно». Он может не знать, что конкретно пойдет не так, но должен быть готов к этому и иметь в запасе все ресурсы, которые позволят всё исправить.</li>
        </ol>
        <p>Заказчик может внезапно уехать в отпуск и сорвать сроки согласования. А потом он решит, что его сайту необходим дополнительный функционал, за который он не готов платить, да и срок реализации проекта тоже не хотелось бы увеличивать, так что «давайте попробуем как-то уложиться, вы же профессионалы».</p>
        <p>Обязательно произойдет еще десяток незапланированных событий, каждое из которых либо будет грозить проекту срывом всех сроков и увеличением бюджета, либо похоронит проект вообще.
Это не должно вызывать особых эмоций и влиять на мотивацию. Обычные рабочие дела, которые менеджер проекта предвидел и, конечно же, может решить.
</p>
    </div>
];

export const step5 = [
    <div>
    <Typography variant="h4">Игра. Get-kanban</Typography>
</div>
];


export const finalStep = [
    <div>
        <p>
            Менеджер добавил задач на доске и все стало веселее.
            Можно приступать к выполнению задач.
        </p>
    </div>
];